[{
  "pic_id": "",
  "title": "",
  "text": "",
  "tts": ""
},
{
  "pic_id": "",
  "title": "Начало контрнаступления советских войск под Сталинградом",
  "text": "19 ноября 1942 года в ходе Великой Отечественной войны началась одна из крупнейших стратегических операций советских войск под кодовым названием «Уран». Началось контрнаступление в районе Сталинграда. В ходе Сталинградской наступательной операции были уничтожены две немецкие, разгромлены две румынские и одна итальянская армии. ",
  "tts": ""
},
  {
  "pic_id": "",
  "title": "Взятие советскими войсками Шлиссельбурга",
  "text": "Прорыв блокады Ленинграда начался по приказу Ставки Верховного главнокомандующего 12 января 1943 г. Около полуночи 18 января по радио было передано сообщение о прорыве блокады. Вышедшие на улицы и проспекты горожане ликовали. Рано утром 19 января город-герой был украшен флагами. С прорывом блокады значительно улучшилась обстановка на всём Ленинградском фронте. Полностью блокадное кольцо было снято лишь спустя год — 27 января 1944 г.",
  "tts": ""
},
  {
  "pic_id": "",
  "title": " Завершение Сталинградской битвы",
  "text": "Сталинградская битва являлась важнейшим военно-политическим событием второй мировой войны. Она закончилась окружением, разгромом и взятием в плен немецкой группировки, оказала серьезное влияние на дальнейший ход войны. Битва явилась переломом в Великой Отечественной войне. Красная армия овладела стратегической инициативой.",
  "tts": ""
},
  {
  "pic_id": "",
  "title": "Курская битва",
  "text": "Важнейшим событием всей Второй мировой войны стала битва на Курской дуге с 5 июля по 23 августа 1943 года. Планы командования вермахта окружить и уничтожить советские войска на Курском выступе были разрушены. Красная Армия сама перешла в контрнаступление и нанесла тяжёлое поражение противнику. Курскую битву многие историки считают завершением коренного перелома в войне.",
  "tts": ""
},
  {
  "pic_id": "",
  "title": " Освобождение Орла и Белгорода",
  "text": "5 августа 1943 года в Москве был дан артиллерийский салют войскам, освободившим Орел и Белгород. Этот салют был первым за время Великой Отечественной войны, поэтому и за Орлом, и за Белгородом закрепились название «город первого салюта».",
  "tts": ""
},
  {
  "pic_id": "",
  "title": "Операция 'Полководец Румянцев'",
  "text": "Белгородско-Харьковская операция или «Полководец Румянцев» с 3 по 23 августа 1943 года стала завершающим этапом Курской битвы – оборонительной и наступательной операции советской армии в районе Курского выступа. В ходе этих боев было сорвано крупное наступление немецкой армии и разгромлена мощная группировка противника. К концу июля Красной Армии удалось остановить наступление фашистских войск на Курской дуге и развенчать немецкий миф о том, что в летних условиях Красная Армия всегда лишь отступает, а победа достается войскам вермахта.",
  "tts": ""
},
  {
  "pic_id": "",
  "title": "Битва за Днепр",
  "text": "Освобождение Днепра, Киева и Украины в целом имело огромное политическое и моральное значение для Советского Союза. Во-первых, удалось вернуть захваченные ранее территории со всеми их ресурсами, во-вторых, Украина давала Советскому Союзу выход к границам Румынии и Польши, и в дальнейшем самой Германии.",
  "tts": ""
},{
  "pic_id": "",
  "title": "Освобождение Киева",
  "text": "6 ноября 1943 года - памятная дата военной истории Отечества. В этот день советские войска освободили Киев от немецко-фашистских захватчиков.",
  "tts": ""
}
]
