{
    "pic_id":"",
    "title":"",
    "text":"",
    "tts":""
},
{
    "pic_id":"",
    "title":"Взятие советскими войсками Шлиссельбурга",
    "text":"Операция Искра — наступательная операция советских войск во время Великой Отечественной войны, проведённая с 12 по 30 января 1943 года силами Ленинградского и Волховского фронтов при содействии части сил Балтийского флота, Ладожской военной флотилии и авиации дальнего действия с целью прорыва блокады Ленинграда.
    18 января 1943 года блокаду Ленинграда прорвали. Согласно первоначальному плану советские войска продолжили наступление с целью разгрома мгинско-синявинской группировки противника и обеспечения надёжной железнодорожной связи Ленинграда со страной, но в ожесточённых боях в феврале—апреле развить достигнутый в январе успех не удалось.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Капитуляция германских войск под Сталинградом",
    "text":"Сталинградская битва — одно из важнейших сражений Второй Мировой и Великой Отечественной войн между Красной армией и Вермахтом при поддержке армий стран «оси». Происходила на территории современных Воронежской, Ростовской, Волгоградской областей и Республики Калмыкии с 17 июля 1942 по 2 февраля 1943 года.
    Немецкое наступление продолжалось с 17 июля по 18 ноября 1942 года, его целью был захват большой излучины Дона, волгодонского перешейка и Сталинграда.
    Осуществление этого плана блокировало бы транспортное сообщение между центральными районами СССР и Кавказом, создало бы плацдарм для дальнейшего наступления с целью захвата кавказских месторождений нефти.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Курская битва",
    "text":"Курская битва — совокупность стратегических оборонительной и наступательных операций Красной армии в Великой Отечественной войне с целью сорвать крупное наступление сил вермахта и разгромить его стратегическую группировку. По своим масштабам, задействованным силам и средствам, напряжённости, результатам и военно-политическим последствиям является одним из ключевых сражений Второй мировой войны и Великой Отечественной войны. В историографии считается самым крупным танковым сражением в истории. В нём участвовали около 2 млн человек, 6 тысяч танков, 4 тысячи самолётов; сражение проложило «путь к великим советским наступательным действиям 1944-45 годов».",
    "tts":""
},
{
    "pic_id":"",
    "title":"Освобождение Орла и Белгорода",
    "text":"Город первого салюта — неофициальное название городов Орла и Белгорода, которые 5 августа 1943 года в ходе Курской битвы были освобождены от немецко-фашистских захватчиков войсками Западного, Центрального, Воронежского, Брянского и Степного фронтов. Город Орёл был освобождён утром, а Белгород в 18:00 по московскому времени.
    По приказу И. В. Сталина № 2 от 5 августа 1943 года, в этот день в Москве был дан артиллерийский салют войскам, освободившим Орёл и Белгород. Этот салют был первым за время Великой Отечественной войны, поэтому за Орлом и Белгородом закрепилось название «город первого салюта». В том же приказе Верховный Главнокомандующий впервые присвоил особо отличившимся в боях частям и соединениям почётные наименования «Орловских» и «Белгородских».",
    "tts":""
},
{
    "pic_id":"",
    "title":"Освобождение Харькова",
    "text":"Белгородско-Харьковская стратегическая наступательная операция «Румянцев» — заключительная операция Курской битвы, проводилась с 3 по 23 августа 1943 года с целью нанесения поражения белгородско-харьковской группировке вермахта, освобождения Харьковского промышленного района, создания предпосылок для окончательного освобождения Левобережной Украины. Операция осуществлялась силами Воронежского и Степного фронтов. Кодовое название — Полководец Румянцев.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Битва за Днепр",
    "text":"Битва за Днепр — ряд взаимосвязанных стратегических операций Великой Отечественной войны, проведённых ВС Союза ССР, во второй половине 1943 года на берегах Днепра.
    С обеих сторон в битве приняло участие до 4 млн человек, а её фронт растянулся на 750 километров. В результате четырёхмесячной операции Левобережная Украина была почти полностью освобождена Красной армией от нацистских захватчиков. В ходе операции значительные силы Красной Армии форсировали реку, создали несколько стратегических плацдармов на правом берегу реки, а также освободили город Киев. Битва за Днепр стала одним из крупнейших сражений в мировой истории.", 
    "tts":""
},