{
    "pic_id":"",
    "title":"",
    "text":"",
    "tts":""
},
{
    "pic_id":"",
    "title":"Взятие советскими войсками Шлиссельбурга",
    "text":"Операция Искра — наступательная операция советских войск во время Великой Отечественной войны, проведённая с 12 по 30 января 1943 года силами Ленинградского и Волховского фронтов при содействии части сил Балтийского флота, Ладожской военной флотилии и авиации дальнего действия с целью прорыва блокады Ленинграда.
    18 января 1943 года блокаду Ленинграда прорвали. Согласно первоначальному плану советские войска продолжили наступление с целью разгрома мгинско-синявинской группировки противника и обеспечения надёжной железнодорожной связи Ленинграда со страной, но в ожесточённых боях в феврале—апреле развить достигнутый в январе успех не удалось.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Капитуляция германских войск под Сталинградом",
    "text":"Сталинградская битва — одно из важнейших сражений Второй Мировой и Великой Отечественной войн между Красной армией и Вермахтом при поддержке армий стран «оси». Происходила на территории современных Воронежской, Ростовской, Волгоградской областей и Республики Калмыкии с 17 июля 1942 по 2 февраля 1943 года.
    Немецкое наступление продолжалось с 17 июля по 18 ноября 1942 года, его целью был захват большой излучины Дона, волгодонского перешейка и Сталинграда.
    Осуществление этого плана блокировало бы транспортное сообщение между центральными районами СССР и Кавказом, создало бы плацдарм для дальнейшего наступления с целью захвата кавказских месторождений нефти.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Курская битва",
    "text":"Курская битва — совокупность стратегических оборонительной и наступательных операций Красной армии в Великой Отечественной войне с целью сорвать крупное наступление сил вермахта и разгромить его стратегическую группировку. По своим масштабам, задействованным силам и средствам, напряжённости, результатам и военно-политическим последствиям является одним из ключевых сражений Второй мировой войны и Великой Отечественной войны. В историографии считается самым крупным танковым сражением в истории. В нём участвовали около 2 млн человек, 6 тысяч танков, 4 тысячи самолётов; сражение проложило «путь к великим советским наступательным действиям 1944-45 годов».",
    "tts":""
},
{
    "pic_id":"",
    "title":"Освобождение Орла и Белгорода",
    "text":"Город первого салюта — неофициальное название городов Орла и Белгорода, которые 5 августа 1943 года в ходе Курской битвы были освобождены от немецко-фашистских захватчиков войсками Западного, Центрального, Воронежского, Брянского и Степного фронтов. Город Орёл был освобождён утром, а Белгород в 18:00 по московскому времени.
    По приказу И. В. Сталина № 2 от 5 августа 1943 года, в этот день в Москве был дан артиллерийский салют войскам, освободившим Орёл и Белгород. Этот салют был первым за время Великой Отечественной войны, поэтому за Орлом и Белгородом закрепилось название «город первого салюта». В том же приказе Верховный Главнокомандующий впервые присвоил особо отличившимся в боях частям и соединениям почётные наименования «Орловских» и «Белгородских».",
    "tts":""
},
{
    "pic_id":"",
    "title":"Освобождение Харькова",
    "text":"Белгородско-Харьковская стратегическая наступательная операция «Румянцев» — заключительная операция Курской битвы, проводилась с 3 по 23 августа 1943 года с целью нанесения поражения белгородско-харьковской группировке вермахта, освобождения Харьковского промышленного района, создания предпосылок для окончательного освобождения Левобережной Украины. Операция осуществлялась силами Воронежского и Степного фронтов. Кодовое название — Полководец Румянцев.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Битва за Днепр",
    "text":"Битва за Днепр — ряд взаимосвязанных стратегических операций Великой Отечественной войны, проведённых ВС Союза ССР, во второй половине 1943 года на берегах Днепра.
    С обеих сторон в битве приняло участие до 4 млн человек, а её фронт растянулся на 750 километров. В результате четырёхмесячной операции Левобережная Украина была почти полностью освобождена Красной армией от нацистских захватчиков. В ходе операции значительные силы Красной Армии форсировали реку, создали несколько стратегических плацдармов на правом берегу реки, а также освободили город Киев. Битва за Днепр стала одним из крупнейших сражений в мировой истории.", 
    "tts":""
},
{
    "pic_id":"",
    "title":"Блокада Ленинграда",
    "text":"Блокада Ленинграда — военная блокада города Ленинграда немецкими, финскими и испанскими войсками с участием добровольцев из Северной Африки, Европы и военно-морских сил Италии во время Великой Отечественной войны. Длилась с 8 сентября 1941 года по 27 января 1944 года — 872 дня. В литературе также встречается число в 871 день.
    К началу блокады в городе имелось недостаточное для длительной осады количество продуктов и топлива. Единственным путём сообщения с Ленинградом оставался маршрут через Ладожское озеро. В результате этого начавшийся в Ленинграде массовый голод привёл к сотням тысяч смертей среди жителей.
    С января по февраль 1944 года советские войска провели Ленинградско-Новгородскую операцию, в результате которой противник был отброшен на 220—280 километров от южных рубежей города. ",
    "tts":""
},
{
    "pic_id":"",
    "title":"Корсунь-Шевченковская операция",
    "text":"Корсунь-Шевченковская операция — наступательная операция войск 1-го и 2-го Украинских фронтов, проведённая 24 января — 17 февраля 1944 года с целью уничтожения корсунь-шевченковской группировки Вермахта. Является частью стратегического наступления советских войск на Правобережной Украине.
    Операция завершилась ликвидацией котла и частичным разгромом окружённой группировки, некоторой части войск удалось вырваться из окружения. Командующий окружённой группировкой генерал Штеммерман погиб в ходе прорыва в ночь с 17 на 18 февраля. Командование взял на себя группенфюрер СС Гилле.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Крымская наступательная операция",
    "text":"Крымская операция 1944 года — наступательная операция советских войск с целью освобождения Крыма от войск нацистской Германии во время Великой Отечественной войны. Проводилась с 8 апреля по 12 мая 1944 года силами 4-го Украинского фронта и Отдельной Приморской армии во взаимодействии с Черноморским флотом и Азовской военной флотилией.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Выборгско-Петрозаводская операция",
    "text":"Выборгско-Петрозаводская операция  — наступление советских войск в Карелии в 1944 году, в ходе Советско-финской войны 1941—1944 с целью ликвидации угрозы Ленинграду, идущим из Мурманска в центральные районы СССР коммуникациям, а также выведение Финляндии из войны. Проводилась силами Ленинградского и Карельского фронтов при поддержке Балтийского флота и Ладожской военной флотилии. В советской и российской историографии данная операция подразделяется на Выборгскую  и Свирско-Петрозаводскую операции.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Операция «Багратион»",
    "text":"Белорусская наступательная операция «Багратион» — крупномасштабная наступательная операция Великой Отечественной войны, проводившаяся 23 июня — 29 августа 1944 года. Названа так в честь полководца, получившего известность в ходе Отечественной войны 1812 года П. И. Багратиона. В ходе операции советская армия нанесла крупнейшее поражение немецкой армии за всю военную историю Германии, разгромив группу армий «Центр» Вермахта. Одна из крупнейших военных операций за всю историю человечества.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Львовско-Сандомирская операция",
    "text":"Львовско-Сандомирская операция — стратегическая военная наступательная операция рабоче-крестьянская красная армия против войск нацистской Германии и Венгрии во время Великой Отечественной войны с целью освобождения Западной Украины и занятия Юго-Восточной Польши. Операция входит в число так называемых 10 сталинских ударов.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Ясско-Кишинёвская операция",
    "text":"Ясско-Кишинёвская операция — стратегическая военная операция Вооружённых сил СССР против нацистской Германии и Румынии во время Великой Отечественной войны с целью разгрома крупной немецко-румынской группировки, прикрывавшей балканское направление, освобождения Молдавии и вывода Румынии из войны.
    Является одной из самых удачных советских операций во время Великой Отечественной войны, входит в число «десяти сталинских ударов». Закончилась победой войск Красной Армии, освобождением Молдавской ССР и полным разгромом противника.",
    "tts":""
},
{
    "pic_id":"",
    "title":"Бухарестско-Арадская операция",
    "text":"Бухарестско-Арадская наступательная операция — фронтовая военная операция войск СССР и Румынии против Германии, Венгрии и румынских антикоммунистов в ходе Великой Отечественной войны, в результате которой от немецко-венгерских войск была освобождена почти вся Румыния.",
    "tts":""
},